export const customColumn = {
    data() {
        return {
            sspHasCheckData: [ // 抽屉 - 流量表格 - 已选择列（下拉滚动）
                // 数据维度
                // '时间',
                '预算位名称',
                '公司/账号名称',
                '预算位素材尺寸比例',
                '预算方广告位ID',
                '产品名称',
                '广告位类型',
                '广告位名称',
                '应用名称',
                '媒体简称',
                '应用平台',
                '广告位素材尺寸比例',

                // 基本指标
                '有效广告请求pv',
                '有效广告请求uv',
                '广告返回pv',
                '广告返回uv',
                '广告展现pv',
                '广告展现uv',
                '广告点击pv',
                '广告点击uv',
				'加群点击数',
                '调起数',
                '下载完成量',
                '安装量',
                '激活量',

                // 效果指标
                '填充率',
                '展现率',
                '点击率',
                '调起率',
                '下载完成率',
                '安装率',
                '激活率',
                '媒体eCPM',
                '媒体CPC',

                // 收益指标
                '成本'
            ],
            ssp_data_dimension: [ // 抽屉 - 流量表格 - 数据维度
                // 数据维度
                // '时间',
                '预算位名称',
                '公司/账号名称',
                '预算位素材尺寸比例',
                '预算方广告位ID',
                '产品名称',
                '广告位类型',
                '广告位名称',
                '应用名称',
                '应用平台',
                '媒体简称',
                '广告位素材尺寸比例'
            ],
            ssp_basic_indicators: [ // 抽屉 - 流量表格 - 基本指标
                '有效广告请求pv',
                '有效广告请求uv',
                '广告返回pv',
                '广告返回uv',
                '广告展现pv',
                '广告展现uv',
                '广告点击pv',
                '广告点击uv',
				'加群点击数',
                '调起数',
                '下载完成量',
                '安装量',
                '激活量'
            ],
            ssp_effect_indicators: [ // 抽屉 - 流量表格 - 效果指标
                '填充率',
                '展现率',
                '点击率',
                '调起率',
                '下载完成率',
                '安装率',
                '激活率',
                '媒体eCPM',
                '媒体CPC'
            ],
            ssp_income_indicators: [ // 抽屉 - 流量表格 - 收益指标
                '成本'
            ]
        }
    }
}
